Reports/ТемпературныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ТемпературныйЛист</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ТемпературныйЛист/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьОтчет(ИзменяемыйТабличныйДокумент = Неопределено, Клиент, МедицинскаяКарта, Дата, ДатаОкончания, ПервыйЛист = Истина) Экспорт
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	Иначе
		ТабличныйДокумент = ИзменяемыйТабличныйДокумент;
	КонецЕсли;
		
	ТабличныйДокумент.Очистить();	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ЭтотОбъект.ПолучитьМакет("ТемпературныйЛист");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончание", КонецДня(ДатаОкончания));
	РезультатЗапроса = Запрос.Выполнить();
	ДокПоступления = Стационар.ОбращениеПоМедкарте(МедицинскаяКарта);
	
	Если ПервыйЛист Тогда
		Шапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ЗаполнитьПараметрыШапки(Шапка, ДокПоступления, Клиент, МедицинскаяКарта);
	Иначе
		Шапка = Макет.ПолучитьОбласть("ОбластьПродолжение");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Шапка);
	
	График = Новый ТабличныйДокумент;
	ЗаполнитьПараметрыГрафика(Макет, РезультатЗапроса, ДокПоступления, Дата, ТабличныйДокумент);
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапроса()
		
	Возврат "ВЫБРАТЬ
	        |	ВыполнениеДействийСтационара.Клиент КАК Клиент,
	        |	ВыполнениеДействийСтационара.Документ.МедицинскаяКарта КАК МедицинскаяКарта,
	        |	ВыполнениеДействийСтационара.ДействиеСтационара КАК ДействиеСтационара,
	        |	ВыполнениеДействийСтационара.Значение КАК Значение,
	        |	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК ДатаВремяВыполнения,
	        |	ВыполнениеДействийСтационара.ДействиеСтационара.ИмяПредопределенныхДанных КАК ДействиеСтационараИмяПредопределенныхДанных
	        |ИЗ
	        |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	        |ГДЕ
	        |	ВыполнениеДействийСтационара.Клиент = &Клиент
	        |	И (ВыполнениеДействийСтационара.Документ.МедицинскаяКарта = &МедицинскаяКарта
	        |			ИЛИ ВыполнениеДействийСтационара.Документ = НЕОПРЕДЕЛЕНО)
	        |	И ВыполнениеДействийСтационара.ДатаВремяВыполнения <= &ДатаОкончание
	        |	И ВыполнениеДействийСтационара.ДатаВремяВыполнения >= &Дата
	        |	И ВыполнениеДействийСтационара.ДействиеСтационара.Предопределенный
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаВремяВыполнения
			|ИТОГИ ПО
	        |	ДатаВремяВыполнения";
			
КонецФункции

Процедура ЗаполнитьПараметрыШапки(Шапка, ДокПоступления, Клиент, МедицинскаяКарта)
	
	Шапка.Параметры.ФИОБольного = СокрЛП(Клиент.Фамилия) + " " + СокрЛП(Клиент.Имя) + " " + СокрЛП(Клиент.Отчество);
	Шапка.Параметры.Возраст = ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(Клиент.ДатаРождения);
	Шапка.Параметры.РостПациента = ПолучитьРостПациента(МедицинскаяКарта);
	
	// Изменено Макеев (
	//Если ЗначениеЗаполнено(ДокПоступления) Тогда
	//	Шапка.Параметры.КодПоОКПО	= ДокПоступления.Филиал.ОКПО;
	//	Шапка.Параметры.НаименованиеУчреждения = ДокПоступления.Филиал.НазваниеОрганизации;
	//КонецЕсли;
	// )
	
КонецПроцедуры

Функция ПолучитьРостПациента(МедицинскаяКарта)
	
	КодВитальногоПар = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(57, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры);
	ЗначенияРоста = МедицинскаяДеятельность.ЗначенияПоНазначениямПолейМедкарты(МедицинскаяКарта, КодВитальногоПар);
	
	Если ЗначенияРоста.Количество() <> 0 Тогда
		Возврат ЗначенияРоста[ЗначенияРоста.Количество() - 1].Значение;
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

Процедура ЗаполнитьПараметрыГрафика(Макет, РезультатЗапроса, ДокПоступления, Дата, ТабличныйДокумент)
		
	ВыборкаЗапросаДни = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сч=1;
	ТекДата = НачалоДня(Дата);
	ДеньГоспитализации = (ТекДата-НачалоДня(ДокПоступления.ДатаВремяГоспитализации))/86400+1;
	ОбластьГрафик = Макет.ПолучитьОбласть("ОбластьГрафик");
	ПерваяЧастьТаблицыВыведена = Ложь;
	
	// Добавлено Макеев (
	СложныеПоля = Новый Соответствие;
	// )
	Пока ВыборкаЗапросаДни.Следующий() Цикл
		ОбластьГрафик.Параметры["Дата"+Сч] = Формат(ВыборкаЗапросаДни.ДатаВремяВыполнения, "ДФ=dd.MM.yy" );
		ВремяССекундами = Формат(ВыборкаЗапросаДни.ДатаВремяВыполнения, "ДЛФ=T");
		ВремяБезСекунд = Лев(ВремяССекундами, СтрДлина(ВремяССекундами) - 3);
		ОбластьГрафик.Параметры["Время"+Сч] = ВремяБезСекунд;
		ОбластьГрафик.Параметры["День"+Сч] = (НачалоДня(ВыборкаЗапросаДни.ДатаВремяВыполнения) - НачалоДня(ДокПоступления.ДатаВремяГоспитализации))/86400+1;
		
		ВыборкаДетальныеЗаписи = ВыборкаЗапросаДни.Выбрать();
		ДанныеВСтолбецВнесены = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                  	
			Если ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.Температура Тогда
				Значение =  ВыборкаДетальныеЗаписи.Значение; 
				Если Значение >= 41 Тогда
					ОбластьГрафик.Параметры[Строка("т41_" + Сч)] = Значение;
				ИначеЕсли Значение < 35 Тогда
					ОбластьГрафик.Параметры[Строка("т34_" + Сч)] = Значение;
				Иначе
					ОбластьГрафик.Параметры[Строка("т" + Цел(Значение) + "_" + Сч)] = Значение;
				КонецЕсли;
				ДанныеВСтолбецВнесены = Истина;
			// Добавлено Макеев (
			ИначеЕсли ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.АртериальноеДавление 
				Или ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.АртериальноеДавлениеНижнее Тогда
				СложныеПоля.Вставить(ВыборкаДетальныеЗаписи.ДействиеСтационара, ВыборкаДетальныеЗаписи.Значение); 
			// )
			Иначе
				Попытка
					ИмяПарам = ВыборкаДетальныеЗаписи.ДействиеСтационараИмяПредопределенныхДанных;
					ОбластьГрафик.Параметры[Строка(ИмяПарам + Сч)] = ВыборкаДетальныеЗаписи.Значение;	
					ДанныеВСтолбецВнесены = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		// Добавлено Макеев (
		АД1 = СложныеПоля.Получить(Справочники.ДействияМедсестрыСтационара.АртериальноеДавление);
		АД2 = СложныеПоля.Получить(Справочники.ДействияМедсестрыСтационара.АртериальноеДавлениеНижнее);
		Если ЗначениеЗаполнено(АД1) Тогда
			ОбластьГрафик.Параметры[Строка("АртериальноеДавление" + Сч)] =  Строка(АД1) + "/" + Строка(АД2);
		КонецЕсли;
		// )
		
		Если ДанныеВСтолбецВнесены Тогда
			Сч = Сч + 1;
			Если Сч > 30 Тогда
				Если ПерваяЧастьТаблицыВыведена Тогда
					ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОбластьПродолжение"));
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьГрафик);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьГрафик = Макет.ПолучитьОбласть("ОбластьГрафик");
				ПерваяЧастьТаблицыВыведена = Истина;
				Сч = 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПерваяЧастьТаблицыВыведена Тогда
		ТабличныйДокумент.Вывести(ОбластьГрафик);
	ИначеЕсли (ПерваяЧастьТаблицыВыведена И Сч > 1) Тогда 
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОбластьПродолжение"));
		ТабличныйДокумент.Вывести(ОбластьГрафик);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
